src/cf/Catalogs/ВидыДоходовПоСтраховымВзносамУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыДоходовПоСтраховымВзносамУНФ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходитВБазуПФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВБазуФСС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВБазуФОМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ВидыДоходовПоСтраховымВзносамУНФ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устарела. Будет удалена в следующей версии программы.
//
Процедура ЗаполнитьВидыДоходовПоСтраховымВзносам() Экспорт

	СпрВидов = Справочники.ВидыДоходовПоСтраховымВзносамУНФ;

	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.НеЯвляетсяОбъектом, Ложь, Ложь, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.НеОблагаетсяЦеликом, Ложь, Ложь, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ПособияЗаСчетФСС, Ложь, Ложь, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ПособияЗаСчетФСС_НС, Ложь, Ложь, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ДенежноеДовольствиеВоеннослужащих, Ложь, Ложь, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ДенежноеСодержаниеПрокуроров, Ложь, Истина, Истина); // ПФР, ФОМС , ФСС

	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ОблагаетсяЦеликом, Истина, Истина, Истина);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ДоходыСтудентовЗаРаботуВСтудотрядеПоТрудовомуДоговору, Ложь,
		Истина, Истина); // ПФР, ФОМС, ФСС
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.Матпомощь, Истина, Истина, Истина);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.МатпомощьПриРожденииРебенка, Истина, Истина, Истина);

	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ДоговорыГПХ, Истина, Истина, Ложь); // ПФР, ФОМС, ФСС
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ДоходыСтудентовЗаРаботуВСтудотрядеПоГражданскоПравовомуДоговору,
		Ложь, Истина, Ложь); // ПФР, ФОМС, ФСС
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеАудиовизуальныеПроизведения, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеГрафическиеПроизведения, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеДругиеМузыкальныеПроизведения, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеИсполнениеПроизведений, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеЛитературныеПроизведения, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеМузыкальноСценическиеПроизведение, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеНаучныеТруды, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеОткрытия, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеСкульптуры, Истина, Истина, Ложь);

КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт

	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;

КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НеЯвляетсяОбъектом";
	Элемент.Наименование = НСтр("ru='Доходы, не являющиеся объектом обложения страховыми взносами'");
	Элемент.ВходитВБазуПФР = Ложь;
	Элемент.ВходитВБазуФОМС = Ложь;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НеОблагаетсяЦеликом";
	Элемент.Наименование = НСтр("ru='Доходы, целиком не облагаемые страховыми взносами, кроме пособий за счет ФСС и денежного довольствия военнослужащих'");
	Элемент.ВходитВБазуПФР = Ложь;
	Элемент.ВходитВБазуФОМС = Ложь;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПособияЗаСчетФСС";
	Элемент.Наименование = НСтр("ru='Государственные пособия обязательного социального страхования, выплачиваемые за счет ФСС'");
	Элемент.ВходитВБазуПФР = Ложь;
	Элемент.ВходитВБазуФОМС = Ложь;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПособияЗаСчетФСС_НС";
	Элемент.Наименование = НСтр("ru='Государственные пособия по обязательному страхованию от несчастных случаев и профзаболеваний'");
	Элемент.ВходитВБазуПФР = Ложь;
	Элемент.ВходитВБазуФОМС = Ложь;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДенежноеДовольствиеВоеннослужащих";
	Элемент.Наименование = НСтр("ru='Денежное довольствие военнослужащих и приравненных к ним лиц рядового и начальствующего состава МВД и других ведомств'");
	Элемент.ВходитВБазуПФР = Ложь;
	Элемент.ВходитВБазуФОМС = Ложь;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДенежноеСодержаниеПрокуроров";
	Элемент.Наименование = НСтр("ru='Денежное содержание прокуроров, следователей и судей, не облагаемое страховыми взносами в ПФР'");
	Элемент.ВходитВБазуПФР = Ложь;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Истина;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОблагаетсяЦеликом";
	Элемент.Наименование = НСтр("ru='Доходы, целиком облагаемые страховыми взносами'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Истина;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДоходыСтудентовЗаРаботуВСтудотрядеПоТрудовомуДоговору";
	Элемент.Наименование = НСтр("ru='Доходы студентов за работу в студотряде по трудовому договору'");
	Элемент.ВходитВБазуПФР = Ложь;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Истина;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Матпомощь";
	Элемент.Наименование = НСтр("ru='Материальная помощь, облагаемая страховыми взносами частично'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Истина;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МатпомощьПриРожденииРебенка";
	Элемент.Наименование = НСтр("ru='Материальная помощь при рождении ребенка, облагаемая страховыми взносами частично'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Истина;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДоговорыГПХ";
	Элемент.Наименование = НСтр("ru='Договоры гражданско-правового характера'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДоходыСтудентовЗаРаботуВСтудотрядеПоГражданскоПравовомуДоговору";
	Элемент.Наименование = НСтр("ru='Доходы студентов за работу в студотряде по гражданско-правовому договору'");
	Элемент.ВходитВБазуПФР = Ложь;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АвторскиеАудиовизуальныеПроизведения";
	Элемент.Наименование = НСтр("ru='Создание аудиовизуальных произведений (видео-, теле- и кинофильмов)'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АвторскиеГрафическиеПроизведения";
	Элемент.Наименование = НСтр("ru='Создание художественно-графических произведений, фоторабот для печати, произведений архитектуры и дизайна'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АвторскиеДругиеМузыкальныеПроизведения";
	Элемент.Наименование = НСтр("ru='Создание других музыкальных произведений, в том числе подготовленных к опубликованию'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АвторскиеИсполнениеПроизведений";
	Элемент.Наименование = НСтр("ru='Исполнение произведений литературы и искусства'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АвторскиеЛитературныеПроизведения";
	Элемент.Наименование = НСтр("ru='Создание литературных произведений, в том числе для театра, кино, эстрады и цирка'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АвторскиеМузыкальноСценическиеПроизведение";
	Элемент.Наименование = НСтр("ru='Создание музыкально-сценических произведений (опер, балетов и др.), симфонических, хоровых, камерных, оригинальной музыки для кино и др.'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АвторскиеНаучныеТруды";
	Элемент.Наименование = НСтр("ru='Создание научных трудов и разработок'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АвторскиеОткрытия";
	Элемент.Наименование = НСтр("ru='Открытия, изобретения и создание промышленных образцов (процент суммы дохода, полученного за первые два года использования)'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АвторскиеСкульптуры";
	Элемент.Наименование = НСтр("ru='Создание произведений скульптуры, монументально- декоративной живописи, декоративно-прикладного и оформительского искусства, станковой живописи и др.'");
	Элемент.ВходитВБазуПФР = Истина;
	Элемент.ВходитВБазуФОМС = Истина;
	Элемент.ВходитВБазуФСС = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОписатьВидДоходаПоСтраховымВзносам(СпособОтражения, ВходитВБазуПФР, ВходитВБазуФОМС, ВходитВБазуФСС)

	Объект = СпособОтражения.ПолучитьОбъект();
	Объект.ВходитВБазуПФР = ВходитВБазуПФР;
	Объект.ВходитВБазуФОМС = ВходитВБазуФОМС;
	Объект.ВходитВБазуФСС = ВходитВБазуФСС;
	Объект.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
